Revit 2024 API
BuiltInFailures.SketchFailures.SketchFailurePlanes Property
 Sketch is no longer parallel to its defining plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchFailurePlanes { get; }
Visual Basic
Public Shared ReadOnly Property SketchFailurePlanes As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchFailurePlanes {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace